posts/reading/spring-integration-in-action/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Spring Integration in Action | Warren Liu</title>
<link href="../../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/poole.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/lanyon.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/custom.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://wudong.graceliu.uk/posts/reading/spring-integration-in-action/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../thoughtful-machine-learning/" title="Thoughtful machine learning" type="text/html">
<link rel="next" href="../soa-patterns/" title="SOA Patterns" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Spring Integration in Action">
<meta property="og:url" content="https://wudong.graceliu.uk/posts/reading/spring-integration-in-action/">
<meta property="og:description" content="Table of Contents


Introduction
Enterprise integration fundamentals
Messages and Channels






Introduction


Spring Integration consists of two parts:

At its core, a messaging framework that suppo">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="java">
<meta property="article:tag" content="spring">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../../rss.xml">RSS feed</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://wudong.graceliu.uk/" title="Warren Liu" rel="home">Warren Liu</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Spring Integration in Action</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Warren Liu</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Enterprise integration fundamentals</a></li>
<li><a href="#sec-3">Messages and Channels</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Spring Integration consists of two parts:
<ul class="org-ul">
<li>At its core, a <i>messaging framework</i> that supports lightweight,
event-driven interactions <b>within</b> an application.
<ul class="org-ul">
<li>The components in it would exist within the scope of a single
Spring application context.
</li>
<li>They would exchange messages in a lightweight manner because
they are running in the same instance of a JVM.
</li>
<li>No serialization is needed, most messages will contain POJO
instances as their payloads.
</li>
</ul>
</li>
<li>On top of the core, an adapter-based platform that support
flexible integration of application across the enterprise.
<ul class="org-ul">
<li>Adapters are used to map the content from outbound messages into
the format that some external system expectes.
</li>
<li>map inbound content from those external systems into messages.
</li>
<li>In Spring Integration 2.0, following adapters are supported:
<ul class="org-ul">
<li>Filesystem, FTP, or SFTP
</li>
<li>UDP, TCP
</li>
<li>HTTP (REST)
</li>
<li>Web services (SOAP)
</li>
<li>Main (POP3, IMAP, SMTP)
</li>
<li>Java Message Service (JMS)
</li>
<li>Java Database Connectivity (JDBC)
</li>
<li>Java Management Extension (JMX)
</li>
<li>Remote Method Invocation (RMI)
</li>
<li>Really Simple Syndication (RSS) feeds
</li>
<li>Twitter
</li>
<li>Extensible Messaging and Presence Protocol (XMPP)
</li>
</ul>
</li>
<li>In Spring Integration:
<dl class="org-dl">
<dt> Channel Adapter </dt>
<dd>any unidirectional inbound <b>OR</b> outbound adapter.
</dd>
<dt> Messaging Gateway </dt>
<dd>bidirectional, or request-reply adapter.
</dd>
</dl>
</li>
</ul>
</li>
</ul>
</li>
<li>Message Channels
<ul class="org-ul">
<li>Although the most important characteristic of any channel is that
it <i>logically</i> decouples producers from consumers, there are a
number of <i>practical</i> implementation options
<ul class="org-ul">
<li>A channel implementation might dispatch messages directly to
<b>passive</b> consumers within the <i><b>same</b> thread of control</i>.
</li>
<li>A channel might buffer messages in a queue whose
reference is shared by producer and an <b>active</b> consumer such
that the send and receive operations each occur within <i><b>different</b>
threads of control</i>.
</li>
<li>Channels might be classified according to whether messages are
delivered to a single endpoint (point-to-point), or to any
endpoint that is listening to the channel (publish-subscribe).
</li>
</ul>
</li>
<li>Channels can be categorized based on two dimension
<ul class="org-ul">
<li>type of handoff : synchronous, or asynchronous
</li>
<li>type of delivery
<ul class="org-ul">
<li>Point-to-point
<ul class="org-ul">
<li>Each single message is received by exactly <b>one</b> consumer.
</li>
<li>
<b>Competing Consumers</b>: Multiple comsumers can compete for
messages from a single channel.
</li>
</ul>
</li>
<li>Publish-subscribe: delivers the same message to zero or more
subscribers.
<ul class="org-ul">
<li>The drawback of it is tha tthe sender isn't informed about
message delivery or failure to the same extent as in
point-to-point configurations.
</li>
<li>Often require failure-handling patterns such as <b>Idempotent
Receiver</b> or <b>Compensating Transactions</b>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li>Message Endpoints
<ul class="org-ul">
<li>Channel Adapter
</li>
<li>Message Gateway
</li>
<li id="Service Activator">is a component that invokes a service based
on an incoming message and sends an outbound message based on
the return value of this service invocation.
<ul class="org-ul">
<li>In Spring Integration, it is constrained to local method calls.
</li>
<li>Can be think of as a method-invoking outbound gateway.
</li>
</ul>
</li>
<li id="Router">determines the next channel a message should be send to
based on the incomming message.
</li>
<li id="Splitter">receives one message and splits it into multiple
messages that are send to its output channels.
<ul class="org-ul">
<li>Useful whenever the act of processing message content can be
split into multiple steps and executed by different consumers at
the same time.
</li>
</ul>
</li>
<li id="Aggregator">waits for a group of correlated messages and merges
them together when the group is completed.
<ul class="org-ul">
<li>The correlation of the messages typically is based on a
<b>correlation ID</b>.
</li>
<li>A splitter and an aggregator are often used in a symmetric setup.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Enterprise integration fundamentals</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Identifying highly coupled system
<ul class="org-ul">
<li>One measure could be how many user types a class references. When
a class is referencing <i>many user types</i>, it is considered <span class="underline">highly coupled</span>.
</li>
<li>A general way of defining coupling is as a measure of how
connected the parts of a system are or how many assumptions the
components of the system make about each other.
</li>
</ul>
</li>
<li>Event-driven architecture
<dl class="org-dl">
<dt> Staged event-driven architecture (SEDA) </dt>
<dd>events are communicated via
channels that can act as buffers in periods of high throughput.
<ul class="org-ul">
<li>generally respond better to significant <i>spikes in load</i>.
</li>
</ul>
</dd>
</dl>
</li>
<li>Synchronous and asynchronous communication
<ul class="org-ul">
<li>In Spring Integration, simple configuration option allow you
switch between the two without channing the overall logical design
of the application.
</li>
<li>With an increased load, the synchronous communication has few alternatives:
<ul class="org-ul">
<li>Trying to accomodate all requests as they arrive, which will
crash the system.
</li>
<li>Throttling some of the requests to bring the load to a bearable level.
</li>
<li>The application will eventually fail, when the load increases.
</li>
</ul>
</li>
<li>Unlike synchronous calls when the load of the system is controlled
by the <b>requesting side</b>, in asynchronous model, the load of the
system is controllered by the <b>service provider's side</b>.
</li>
<li>Asynchronous communication has the obvious advantages in terms of
<i>scalabiity</i> and <i>robustness</i>, but it brings in <b>complexity</b>.
</li>
<li>In Spring Integration, the two interaction model is determined by
the type of channel that is used for transferring the messages
between then endpoints
<ul class="org-ul">
<li>
<b>DirectChannel</b> for synchronous
</li>
<li>
<b>QueueChannel</b> for asynchronous
</li>
<li>The interaction model doesn't affect the logical design of the
system on how many channels, what endpoints, and how they are connected.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Messages and Channels</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Three types of messages based on the role they fulfill:
<ul class="org-ul">
<li>Document messages that contain only information
</li>
<li>Command messages that instruct the recipient to perform various operations
</li>
<li>Event messages that indicate notable occurrences in the system and
to which the recipient may react.
</li>
</ul>
</li>
<li>The <b>Message&lt;T&gt;</b> interface
<div class="highlight"><pre><span></span><span class="kd">public</span> <span class="kd">interface</span> <span class="nc">Message</span><span class="o">&lt;</span><span class="n">T</span><span class="o">&gt;</span> <span class="o">{</span>
    <span class="n">MessageHeaders</span> <span class="nf">getHeaders</span><span class="o">();</span>
    <span class="n">T</span> <span class="nf">getPayload</span><span class="o">();</span>
<span class="o">}</span>
</pre></div>
<ul class="org-ul">
<li>It is rarely necessary to create your own message implementation,
apart from the build-ins with the framework.
</li>
<li>The <b>MessageHeaders</b> are <b>Map</b> with some additional behaviour
<div class="highlight"><pre><span></span><span class="kd">public</span> <span class="kd">final</span> <span class="kd">class</span> <span class="nc">MessageHeaders</span> <span class="kd">implements</span> <span class="n">Map</span><span class="o">&lt;</span><span class="n">String</span><span class="o">,</span> <span class="n">Object</span><span class="o">&gt;,</span> <span class="n">Serializable</span> <span class="o">{}</span>
</pre></div>
</li>
<li>
<b>Message</b> and <b>MessageHeaders</b> are immutable objects, and can be
build with <b>MessageBuilder</b>
</li>
</ul>
</li>
<li>Channels aren't just information transfer components, they play an
<b>active</b> role in defining the overall application behavior.
<ul class="org-ul">
<li>different from other enterprise integration framework.
</li>
</ul>
</li>
<li>The <b>MessageChannel</b> interface
<div class="highlight"><pre><span></span><span class="kd">public</span> <span class="kd">interface</span> <span class="nc">MessageChannel</span> <span class="o">{</span>
    <span class="kt">boolean</span> <span class="nf">send</span><span class="o">(</span><span class="n">Message</span><span class="o">&lt;?&gt;</span> <span class="n">message</span><span class="o">);</span>
    <span class="kt">boolean</span> <span class="nf">send</span><span class="o">(</span><span class="n">Msssage</span><span class="o">&lt;?&gt;</span> <span class="n">message</span><span class="o">,</span> <span class="kt">long</span> <span class="n">timeout</span><span class="o">);</span>
<span class="o">}</span>
</pre></div>
</li>
<li>To receiving message, two mechanism through which messages are
handed over to the next endpoint:
<ul class="org-ul">
<li>
<b>SubscribableChannel extends MessageChannel</b> interface
<ul class="org-ul">
<li>
<b>boolean subscribe(MessageHandler handler)</b>
</li>
<li>
<b>boolean unsubscribe(MessageHandler handler)</b>
</li>
</ul>
</li>
<li>
<b>PollableChannel extends MessageChannel</b> interface
<ul class="org-ul">
<li>
<b>Message&lt;?&gt; receive()</b>;
</li>
<li>
<b>Message&lt;?&gt; receive(long timeout)</b>
</li>
</ul>
</li>
</ul>
</li>
<li>Spring Integration offers a number of channel implements. The type
of channel you select has significant implications for your
application, including
<ul class="org-ul">
<li>transactional boundaries,
</li>
<li>lagency
</li>
<li>overall throughput
</li>
<li>The default channel used is <b>SubscribableChannel</b>, and the message
transmission is synchronous.
</li>
</ul>
</li>
<li>Type of channels:
<ul class="org-ul">
<li>
<b>QueueChannel</b>
<ul class="org-ul">
<li>
<b>PriorityChannel</b> with a priority queue.
</li>
</ul>
</li>
<li>
<b>PUblishSubscribeChannel</b> for more than one consumer.
<ul class="org-ul">
<li>It doesn't support queueing,
</li>
<li>but does support asynchronous operation if provided with a task
executor that delivers messages to each of the subscribers in
separate threads.
</li>
</ul>
</li>
<li>
<b>bridge</b> is an enterprise integration pattern that supports the
connection of two channels.
</li>
</ul>
</li>
<li>Channel collaborators:
<ul class="org-ul">
<li>
<b>MessageDispatcher</b> controls how messages sent to a channel are
passed to any registered handlers.
</li>
<li>
<b>ChannelInterceptor</b> allows interception at key points like
channel send and receive operations
</li>
</ul>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/java/" rel="tag">java</a></li>
            <li><a class="tag p-category" href="../../../categories/spring/" rel="tag">spring</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../thoughtful-machine-learning/" rel="prev" title="Thoughtful machine learning">Previous post</a>
            </li>
            <li class="next">
                <a href="../soa-patterns/" rel="next" title="SOA Patterns">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2017         <a href="mailto:wudong@graceliu.uk">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
